
tap 'caskroom/cask'
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'

# Core Homebrew
brew 'adwaita-icon-theme'
brew 'ampl-mp'
brew 'amtk'
brew 'aom'
brew 'arpack'
brew 'asciiquarium'
brew 'aspell'
brew 'assimp'
brew 'atk'
brew 'autoconf'
brew 'bash'
brew 'bdw-gc'
brew 'boost'
brew 'brotli'
brew 'bullet'
brew 'c-ares'
brew 'cairo'
brew 'ceres-solver'
brew 'cmake'
brew 'cmatrix'
brew 'cminpack'
brew 'console_bridge'
brew 'cppzmq'
brew 'curl'
brew 'dartsim'
brew 'dav1d'
brew 'dcraw'
brew 'docbook'
brew 'docbook-xsl'
brew 'double-conversion'
brew 'doxygen'
brew 'eigen'
brew 'emscripten'
brew 'enchant'
brew 'epstool'
brew 'espeak'
brew 'fcl'
brew 'ffmpeg'
brew 'fftw'
brew 'fig2dev'
brew 'flac'
brew 'flann'
brew 'fltk'
brew 'fontconfig'
brew 'freeimage'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'gcc'
brew 'gd'
brew 'gdb'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'gedit'
brew 'gettext'
brew 'gflags'
brew 'ghostscript'
brew 'giflib'
brew 'git-lfs'
brew 'gl2ps'
brew 'glew'
brew 'glib'
brew 'glib-networking'
brew 'glog'
brew 'glpk'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnuplot'
brew 'gnutls'
brew 'go'
brew 'gobject-introspection'
brew 'googler'
brew 'graphicsmagick'
brew 'graphite2'
brew 'graphviz'
brew 'gsettings-desktop-schemas'
brew 'gsl'
brew 'gspell'
brew 'gtk+'
brew 'gtk+3'
brew 'gtk-mac-integration'
brew 'gtkglext'
brew 'gtksourceview4'
brew 'gts'
brew 'guile'
brew 'harfbuzz'
brew 'hdf5'
brew 'heroku'
brew 'heroku-node'
brew 'hicolor-icon-theme'
brew 'htop'
brew 'hwloc'
brew 'icarus-verilog'
brew 'icu4c'
brew 'ignition-cmake0'
brew 'ignition-common1'
brew 'ignition-fuel-tools1'
brew 'ignition-math4'
brew 'ignition-msgs1'
brew 'ignition-tools'
brew 'ignition-transport4'
brew 'ilmbase'
brew 'imagemagick'
brew 'ipopt'
brew 'isl'
brew 'iso-codes'
brew 'jasper'
brew 'jemalloc'
brew 'jenkins-lts'
brew 'jpeg'
brew 'jpeg-turbo'
brew 'jsoncpp'
brew 'lame'
brew 'leptonica'
brew 'libass'
brew 'libbluray'
brew 'libccd'
brew 'libcerf'
brew 'libcroco'
brew 'libdc1394'
brew 'libde265'
brew 'libepoxy'
brew 'libev'
brew 'libevent'
brew 'libffi'
brew 'libglade'
brew 'libheif'
brew 'libice'
brew 'libidn2'
brew 'liblqr'
brew 'libmetalink'
brew 'libmpc'
brew 'libogg'
brew 'libomp'
brew 'libpcap'
brew 'libpeas'
brew 'libpng'
brew 'libpsl'
brew 'libpthread-stubs'
brew 'librsvg'
brew 'libsamplerate'
brew 'libscrypt'
brew 'libsm'
brew 'libsndfile'
brew 'libsodium'
brew 'libsoup'
brew 'libsoxr'
brew 'libssh2'
brew 'libtar'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libusb'
brew 'libvidstab'
brew 'libvorbis'
brew 'libvpx'
brew 'libx11'
brew 'libxau'
brew 'libxaw'
brew 'libxaw3d'
brew 'libxcb'
brew 'libxcursor'
brew 'libxdmcp'
brew 'libxext'
brew 'libxfixes'
brew 'libxi'
brew 'libxinerama'
brew 'libxml2'
brew 'libxmu'
brew 'libxpm'
brew 'libxrandr'
brew 'libxrender'
brew 'libxt'
brew 'libxv'
brew 'libyaml'
brew 'libzip'
brew 'libzzip'
brew 'little-cms2'
brew 'lua'
brew 'lz4'
brew 'lzo'
brew 'mad'
brew 'md5sha1sum'
brew 'meson'
brew 'metis'
brew 'mpfr'
brew 'ncurses'
brew 'neofetch'
brew 'netcdf'
brew 'netpbm'
brew 'nettle'
brew 'nghttp2'
brew 'ngspice'
brew 'ninja'
brew 'nlopt'
brew 'node'
brew 'numpy'
brew 'octave'
brew 'octomap'
brew 'ode'
brew 'ogre1.9'
brew 'open-mpi'
brew 'open-scene-graph'
brew 'openblas'
brew 'opencore-amr'
brew 'opencv'
brew 'openexr'
brew 'openjdk'
brew 'openjdk@11'
brew 'openjpeg'
brew 'openldap'
brew 'openssl@1.1'
brew 'opus'
brew 'opusfile'
brew 'ossp-uuid'
brew 'p11-kit'
brew 'pango'
brew 'pcre'
brew 'perl'
brew 'pixman'
brew 'pkg-config'
brew 'plotutils'
brew 'portaudio'
brew 'protobuf'
brew 'protobuf-c'
brew 'pstoedit'
brew 'pugixml'
brew 'py2cairo'
brew 'py3cairo'
brew 'pygobject'
brew 'pygobject3'
brew 'pygtk'
brew 'pyqt'
brew 'python@2'
brew 'python@3.8'
brew 'python@3.9'
brew 'qhull'
brew 'qrupdate'
brew 'qscintilla2'
brew 'qt'
brew 'qwt'
brew 'rav1e'
brew 'rbenv'
brew 'readline'
brew 'rtmpdump'
brew 'rubberband'
brew 'ruby'
brew 'ruby-build'
brew 'screenfetch'
brew 'screenresolution'
brew 'sdformat6'
brew 'sdl'
brew 'sdl2'
brew 'shared-mime-info'
brew 'simbody'
brew 'sip'
brew 'snappy'
brew 'sox'
brew 'speedtest-cli'
brew 'speex'
brew 'sqlite'
brew 'srt'
brew 'suite-sparse'
brew 'sundials'
brew 'szip'
brew 'tbb'
brew 'tcl-tk'
brew 'tepl'
brew 'tesseract'
brew 'texinfo'
brew 'theora'
brew 'tinyxml'
brew 'tinyxml2'
brew 'tree'
brew 'uchardet'
brew 'ufraw'
brew 'unbound'
brew 'urdfdom'
brew 'urdfdom_headers'
brew 'utf8cpp'
brew 'vala'
brew 'vim'
brew 'vitetris'
brew 'vtk'
brew 'webp'
brew 'wget'
brew 'x264'
brew 'x265'
brew 'xmlto'
brew 'xorgproto'
brew 'xvid'
brew 'xz'
brew 'yarn'
brew 'youtube-dl'
brew 'yuicompressor'
brew 'zbar'
brew 'zeromq'
brew 'zimg'
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'zstd'

# Cask Apps
cask 'amazon-music'
cask 'background-music'
cask 'discord'
cask 'gtkwave'
cask 'iterm2'
cask 'ltspice'
cask 'macspice'
cask 'paintbrush'
cask 'postman'
cask 'trash-it'
cask 'vagrant'
cask 'virtualbox'
cask 'xquartz'

